# img_viewer.py
import io
import os
import PySimpleGUI as sg
from PIL import Image
from PySimpleGUI.PySimpleGUI import R
import tensorflow as tf
from tensorflow import keras
from keras.models import load_model
from keras.preprocessing.image import load_img
from keras.preprocessing.image import img_to_array
from keras.applications.vgg16 import preprocess_input
from keras.applications.vgg16 import decode_predictions
from keras.applications.vgg16 import VGG16
import numpy as np
new_model = tf.keras.models.load_model('my_model.h5')
new_model.summary()
file_types = [("JPEG (*.jpg)", "*.jpg"),
              ("All files (*.*)", "*.*")]
label_thai = ['นกเป็ดผีใหญ่', 'นกร่อนทะเลหางแดง', 'นกกระทุง', 'นกกาน้ำเล็ก', 'นกอ้ายงั่ว', 'นกเขียวก้านตองหน้าผากสีทอง', 'นกแต้วแร้วป่าโกงกาง', 'นกยางโทนใหญ่', 'นกปากห่าง', 'นกกระสาคอขาวปากแดง',
              'นกตะกรุม', 'นกศิวะหางสีตาล', 'นกสาลิกาเขียว', 'นกโพระดกคอสีฟ้า', 'นกพรานผึ้ง', 'นกกระทาญี่ปุ่น', 'นกคุ่มสี', 'นกแว่นสีน้ำตาล', 'นกหว้า', 'นกอีลุ้ม',
              'นกอัญชันคิ้วขาว', 'นกฟินฟุต', 'นกขมิ้น', 'นกหัวโตทรายใหญ่', 'นกนางนวลแกลบหงอนใหญ่', 'นกพิราบ', 'นกชาปีไหน', 'นกกิ้งโครงคอดำ', 'นกยูงไทย', 'นกกระเรียนไทย',
              'นกกระจิบหญ้าท้องเหลือ', 'นกลุมพูขาว', 'นกแขกเต้า', 'นกหกเล็กปากดำ', 'นกเค้าใหญ่พันธุ์สุมาตรา', 'นกพญาไฟสีเทา', 'นกเค้าโมง', 'นกเค้าเหยี่ยว', 'นกกระเต็นเฮอร์คิวลิส', 'นกกระเต็นน้อยธรรมดา',
              'นกกินเปี้ยว', 'นกกระเต็นขาวดำใหญ่', 'นกกระเต็นปักหลัก', 'นกจาบคาหัวเขียว', 'นกตะขาบดง', 'นกกะรางหัวขวาน', 'นกเงือกดำ', 'นกหัวขวานสามนิ้วหลังทอง', 'นกนางแอ่น', 'นกเงือกหัวหงอก',
              'นกกระจิบ']
detail = ['เป็นนกน้ำในวงศ์นกเป็ดผี นกเป็ดผีใหญ่มีลำตัวยาว 46-51 ซม.ช่วงปีกกว้าง 59-73 ซม. ว่ายน้ำและดำน้ำเก่ง',
          'เป็นนกทะเลที่พบในมหาสมุทรอินเดียและมหาสมุทรแปซิฟิก อยู่ในกลุ่มนกร่อนทะเลที่พบเห็นได้ยากแต่ยังมีการกระจายพันธุ์เป็นวงกว้างจึงยังไม่จัดว่าถูกคุกคาม',
          'นกน้ำขนาดใหญ่ชนิดหนึ่ง ในวงศ์นกกระทุง (Pelecanidae) จัดเป็นเพียงชนิดเดียวเท่านั้นในวงศ์นี้ ที่พบได้ในประเทศไทย',
          'เป็นนกชนิดหนึ่ง ในวงศ์นกกาน้ำ (Phalacrocoracidae) เป็นนกกาน้ำขนาดเล็ก มีความยาวจากปลายปากถึงปลายหาง 51-56 เซนติเมตร น้ำหนัก 360-525 กรัม',
          'เป็นนกน้ำชนิดหนึ่ง อยู่ในวงศ์นกอ้ายงั่ว (Anhingidae) ในอันดับนกกระทุง (Pelecaniformes) (แต่บางข้อมูลจัดให้อยู่ในอันดับ Suliformes)',
          'เป็นนกประจำถิ่นที่พบได้ชุกชุมตามป่าดิบแล้งและป่าเต็งรัง แต่ก็อาศัยอยู่ในป่าประเภทอื่นๆด้วย',
          'เป็นนกแต้วแร้วชนิดหนึ่ง เดิมเคยถูกจัดให้เป็นชนิดย่อยของนกแต้วแร้วธรรมดา (P. moluccensis) แต่ปัจจุบันถูกจัดให้เป็นชนิดต่างหากแยกออกมา',
          'เป็นนกลุยน้ำขนาดใหญ่ในวงศ์นกยาง(Ardeidae) มีขนสีขาวตลอดตัว คอยาว มีลักษณะคล้ายนกยางโทนน้อย แต่ปากจะยาวกว่า หัวไม่กลมเหมือนนกยางโทนน้อย',
          'จัดเป็นนกในวงศ์นี้ขนาดเล็ก แต่จุดเด่นที่ไม่เหมือนใครก็คือปากที่ยามหุบจะเหลือช่องตรงกลาง ทำให้มันคาบเปลือกหอยโข่งและหอยเชอรี่ที่ทั้งกลมทั้งลื่นได้อย่างช่ำชอง',
          'เป็นนกกระสาชนิดที่พบเฉพาะทางภาคใต้ของประเทศไทย และจัดเป็นสัตว์ใกล้สูญพันธุ์',
          'เป็นนกน้ำขนาดใหญ่ในวงศ์นกกระสา (Ciconiidae) มีถิ่นที่อยู่อาศัยในทวีปเอเชียทางตอนใต้ ตั้งแต่อินเดีย, เอเชียตะวันออกเฉียงใต้ ไปจนถึงจีนตอนใต้ และเกาะชวา',
          'เป็นนกในวงศ์นกกินแมลงและนกกะราง (Timaliidae) พบในอนุทวีปอินเดียและเอเชียตะวันออกเฉียงใต้ เป็นสัตว์ป่าคุ้มครอง',
          'เป็นนกชนิดหนึ่งในวงศ์นกกา(Corvidae) มีขนาด 38 เซนติเมตร มีปากหนาสีแดงสด วงรอบตาสีแดงและมีแถบสีดำคาดเหมือนหน้ากาก',
          'เป็นนกขนาดเล็กชนิดหนึ่ง อยู่ในวงศ์นกโพระดก (Megalaimidae) มีความยาวจากจะงอยปากจรดหางประมาณ 22-23 เซนติเมตร ขนปกคลุมลำตัวส่วนใหญ่สีเขียว',
          'เป็นนกขนาดเล็กชนิดหนึ่ง ในวงศ์นกพรานผึ้ง (Indicatoridae) เป็นนกขนาดเล็ก (จะงอยปากถึงปลายหาง 17 เซนติเมตร) ลักษณะคล้ายนกปรอดมาก แต่จะงอยปากหนาและอวบกว่า',
          'เป็นนกจำพวกนกกระทาหรือนกคุ่มชนิดหนึ่ง ในวงศ์ไก่ฟ้าและนกกระทา (Phasianidae) มีรูปร่างตัวอ้วนกลม ขนเป็นลายเป็นจุดกระ ๆ สีขาว, สีทอง และขาวสลับดำ',
          'เป็นนกขนาดเล็กชนิดหนึ่ง ในวงศ์ไก่ฟ้าและนกกระทา (Phasianidae) ตัวผู้มีสีสันเด่นกว่านกคุ่ม (Corturnix spp.) ชนิดอื่นมาก',
          'เป็นไก่ฟ้าขนาดกลางในวงศ์ไก่ฟ้าและนกกระทา เป็นญาติใกล้ชิดกลับนกแว่นบอร์เนียว (P. schleiermacheri) ซึ่งแต่เดิมถือเป็นชนิดเดียวกัน',
          'เป็นไก่ฟ้าขนาดใหญ่ขนสีน้ำตาล หัวและคอเป็นสีฟ้า พบในป่าของเกาะบอร์เนียว, เกาะสุมาตรา และ คาบสมุทรมลายูในเอเชียตะวันออกเฉียงใต้',
          'เป็นนกน้ำในวงศ์นกอัญชัน พบในทวีปเอเชียแถบประเทศอินเดีย จีน ไต้หวันเวียดนาม กัมพูชา ฟิลิปปินส์ และในประเทศไทยพบอยู่ทั่วทุกภาค',
          'เป็นนกอัญชันขนาดเล็ก นกชนิดนี้หากินตาม ทะเลสาบ บึง หนอง พรุ นากุ้ง นาข้าว ห้วย คลอง หรือ พื้นที่ที่ชุ่มน้ำต่างๆที่มีพืชลอยน้ำปกคลุมหนาแน่นในพื้นที่ราบ',
          'เป็นนกชนิดหนึ่ง จัดเป็นเพียงชนิดเดียวเท่านั้นที่อยู่ในสกุล Heliopais นกฟินฟุตจัดเป็นนกที่หากินในน้ำและอาศัยอยู่ในพื้นที่ชุ่มน้ำ',
          'เป็นวงศ์ของนกที่มีสายวิวัฒนาการอยู่ระหว่างวงศ์นกแซงแซว (Dicruridae) และวงศ์นกกา (Corvidae) ใช้ชื่อวงศ์ว่า Oriolidae แต่มีรูปร่างลักษณะและอุปนิสัย แตกต่างจากนกทั้งสองวงศ์นี้มาก',
          'มีลักษณะโดยทั่วไปเหมือนกับนกชนิดอื่นในสกุลนกหัวโตเล็ก โดยลักษณะพิเศษประจำพันธุ์คือ เป็นนกขนาดเล็ก ความยาวจากปลายปากจรดปลายหาง ยาว 24 เซนติเมตร (ซม.)',
          'เป็นนกทะเลชนิดหนึ่งในวงศ์นกนางนวลแกลบ (Sternidae) จัดเป็นนกนางนวลแกลบที่มีขนาดใหญ่ มีขนาดลำตัวพอ ๆ กับนกนางนวลทั่วไป',
          'เป็นนกในวงศ์นกพิราบและนกเขา (Columbidae) โดยปกติคำว่า “นกพิราบ” จะหมายถึงนกพิราบเลี้ยง (รวมถึงนกพิราบแฟนซีด้วย) ส่วนนกพิราบนอกเหนือจากนี้จะเรียกว่า “นกพิราบป่า” ',
          'เป็นนกชนิดหนึ่ง จัดอยู่ในวงศ์นกพิราบและนกเขา (Columbidae) นับเป็นนกเพียงชนิดเดียวเท่านั้นที่ยังคงดำรงเผ่าพันธุ์อยู่ในสกุล Caloenas ในขณะที่ชนิดอื่น ๆ',
          'เป็นนกชนิดหนึ่งในวงศ์นกเอี้ยงและนกกิ้งโครง (Sturnidae) เป็นนกที่มีรูปร่างอ้วนป้อม มีขนาดใหญ่กว่านกชนิดอื่นในวงศ์เดียวกัน มีขนาดความยาวประมาณ 27 เซนติเมตร',
          'เป็นไก่ฟ้าขนาดใหญ่ที่พบในป่าเขตร้อนของเอเชียตะวันออกเฉียงใต้ เป็นญาติใกล้ชิดกับนกยูงอินเดียหรือเรียกอีกชื่อหนึ่งว่านกยูงสีฟ้า',
          'เป็นนกขนาดใหญ่ที่ไม่ใช่นกอพยพ พบในบางพื้นที่ของอนุทวีปอินเดีย เอเชียตะวันออกเฉียงใต้ และ ประเทศออสเตรเลีย เป็นนกบินได้ที่สูงที่สุดในโลก',
          'เป็นนกขนาดเล็กในวงศ์นกยอดข้าวและนกกระจิบหญ้า พบในอนุทวีปอินเดียและเอเชียตะวันออกเฉียงใต้',
          'เป็นนกชนิดหนึ่งในวงศ์นกพิราบและนกเขา (Columbidae) มีขนาดความยาวลำตัวประมาณ 40 เซนติเมตร ตัวผู้และตัวเมียมีลักษณะคล้ายกัน',
          'เป็นนกแก้วชนิดหนึ่ง ถือว่าเป็นนกประจำถิ่นที่พบได้ทุกภาคของประเทศไทยยกเว้นเฉพาะภาคใต้เท่านั้นที่ไม่พบ นกชนิดนี้มีลำตัวขนาด 35 เซนติเมตร',
          'เป็นนกแก้วสีเขียวขนาดเล็ก พบในประเทศไทยไปจนถึงบอร์เนียว กินดอกไม้ หน่ออ่อน ผลไม้ และเมล็ดเป็นอาหาร นกหกเล็กปากดำยาวจากปลายปากถึงปลายหาง 12-14.5 เซนติเมตร',
          'นกล่าเหยื่อชนิดหนึ่ง จำพวกนกเค้าแมว หรือนกเค้า มีลักษณะทั่วไปคล้ายกับนกทึดทือมลายู (Ketupa ketupu) ต่างกันที่ตรงที่มีขนคลุมขาท่อนล่าง',
          'เป็นนกอยู่ในวงศ์ย่อย อีกา มีขนาดเล็กมากจนถึงขนาดกลาง ความยาวจากปลายปากจดหาง 20 ซม. มักพบอยู่เป็นฝูง และ อาจพบหากินร่วมกับ นกกินแมลง ชนิดอื่น',
          'นกขนาดเล็กชนิดหนึ่ง จำพวกนกเค้าแมว มีลายสีน้ำตาลทั่วทั้งตัว ด้านใต้ของลำตัวเป็นสีขาวและมีลายสีขาวในแนวตั้งลากยาวขึ้นมาที่บริเวณอกอย่างไม่เป็นระเบียบ มีม่านตาสีเหลือง',
          'เป็นนกเค้าแมวชนิดหนึ่งที่มีขนาดใหญ่ มีลักษณะคล้ายกับนกเหยี่ยวหรืออินทรี มีลำตัวขนาดใหญ่ ปีกกว้างและกลมมน ตากลมโตสีเหลืองทอง ระหว่างตามีแถบคาดสีเหลือง',
          'เป็นนกกระเต็นชนิดหนึ่ง ในวงศ์นกกระเต็นน้อย (Alcedinidae) นับเป็นนกระเต็นที่มีการกระจายพันธุ์ที่กว้างขวางในประเทศแถบเอเชีย',
          'เป็นนกกระเต็นชนิดหนึ่งที่พบได้ในประเทศไทย จัดอยู่ในวงศ์นกกระเต็นน้อย (Alcedinidae) และมีขนาดที่ค่อนข้างเล็กและน่ารัก มีความยาวจากปลายปากจรดปลายหางประมาณ 16 18 เซนติเมตร',
          'นกกระเต็นชนิดหนึ่ง ในวงศ์นกกระเต็น (Halcyonidae) มีส่วนหัวและลำตัวด้านบนสีเขียวแกมฟ้า รอบคอและลำตัวด้านล่างสีขาว ปีกสีฟ้า จะงอยปากใหญ่ด้านบนสีดำ ด้านล่างสีเนื้อ',
          'เป็นนกกระเต็นชนิดหนึ่ง ในวงศ์นกกระเต็นปักหลัก (Cerylidae) นกกระเต็นขาวดำใหญ่ เป็นนกกระเต็นชนิดที่มีขนาดใหญ่ เพราะมีความยาวถึง 43 เซนติเมตร',
          'นกชนิดหนึ่ง ในวงศ์นกกระเต็นปักหลัก(Cerylidae) ถือเป็นเพียงชนิดเดียวเท่านั้นที่อยู่ในสกุล Ceryle มีลักษณะทั่วไป',
          'นกชนิดนี้มีรูปร่างเพรียว มีสีสันสวยงาม โดยจะมีสีเขียวเด่นเป็นพิเศษ บริเวณใบหน้ามีแต้มสีฟ้าเล็กๆ และมีแถบยาวสีดำอยู่ตรงดวงตา ขนที่คอเป็นสีเหลืองและสีน้ำตาล',
          'นกขนาดเล็กชนิดหนึ่ง ในวงศ์นกตะขาบ (Coraciidae) มีขนาดเล็กกว่านกตะขาบทุ่ง (Coracias benghalensis) ซึ่งเป็นนกตะขาบ 1 ใน 2 ชนิดที่พบได้ในประเทศไทย',
          'เป็นนกขนาดกลาง มีลักษณะเด่นที่จำง่ายคือมีหงอนคล้ายหมวกของพวกอินเดียแดง พบทั่วไปในประเทศไทย เป็นนกขนาดกลาง ลำตัวเพรียวยาวประมาณ 30 เซนติเมตร มีลักษณะเด่นที่จำง่าย',
          'เป็นนกเงือกขนาดเล็กชนิดหนึ่ง พบในประเทศบรูไน, อินโดนีเซีย, มาเลเซีย, สิงคโปร์, ไทย, อินเดีย นกเงือกดำยาวจากปลายปากถึงปลายหาง 75-80 เซนติเมตร นกตัวผู้มีขนาดใหญ่กว่านกตัวเมียเล็กน้อย',
          'เป็นนกหัวขวานชนิดหนึ่ง มีลำตัวยาว 30 เซนติเมตร ขนด้านหลังและขนปีกสีเหลืองอมส้ม สะโพกสีแดงสด หางดำ อกและท้องมีจุดกลมสีขาวบนพื้นสีดำ',
          'เป็นนกจับคอนหนึ่งในสองชนิดของสกุลนกนางแอ่นแม่น้ำในวงศ์นกนางแอ่น พบบริเวณบึงบอระเพ็ดในช่วงฤดูหนาวเพียงแห่งเดียวในโลก',
          'เป็นนกเงือกชนิดหนึ่ง และเป็นชนิดเดียวที่อยู่ในสกุล Berenicornis นกเงือกหัวหงอกมีขนาดความยาว ลำตัวประมาณ 90 เซนติเมตร',
          ' เป็นนกขนาดเล็ก จากปลายปากถึงปลายหางรวมกันแล้วยาวเพียง 12 เซนติเมตร ปากเล็กบาง ขายาวเรียวเล็ก ชอบกระดกหางขึ้นลงและกระโดดไปมาตลอดเวลา']

# Left columns
file_list_column = [
    [
        sg.Text("เลือกโฟลเดอร์", font='RSU, 18', background_color='#323232'),
        sg.In(size=(25, 1), enable_events=True, key="-FOLDER-"),
        sg.FolderBrowse(),
    ],
    [
        sg.Listbox(
            values=[], enable_events=True, size=(30, 18), key="-FILE LIST-", font='RSU, 16'
        )
    ],
]

# Right columns
image_viewer_column = [
    [sg.Text("เลือกรูปภาพทางด้านซ้ายเพื่อวิเคราะห์พันธุ์นก", font='RSU, 18', background_color='#323232')],
    [sg.Text("นกพันธุ์ : ", font='RSU, 18', background_color='#323232'),sg.Text( key='-i-', font='RSU, 18', background_color='#323232')],
    [sg.Multiline(size=(30, 3), key='-textbox-', font='RSU, 14', background_color='#323232', text_color='white')],
    [sg.Image(key="-IMAGE-", size=(350,350), background_color='#5A5A5A')],
]

# ----- Full layout -----
layout = [
    [
        sg.Column(file_list_column, background_color='#323232'),
        sg.VSeperator(),
        sg.Column(image_viewer_column, background_color='#323232'),
    ]
]
window = sg.Window("โปรแกรมวิเคราะห์พันธุ์นกในไทย 51 พันธุ์", layout, background_color='#323232')
#การทำงานตาม :Logic
while True:
    event, values = window.read()
    if event == "Exit" or event == sg.WIN_CLOSED:
        break
    # Folder name was filled in, make a list of files in the folder
    if event == "-FOLDER-" or event == "Load Image":
        folder = values["-FOLDER-"]
        try:
            # Get list of files in folder
            file_list = os.listdir(folder)
        except:
            file_list = []

        fnames = [
            f
            for f in file_list
            if os.path.isfile(os.path.join(folder, f))
            and f.lower().endswith((".png", ".jpg", ".jpeg"))
        ]
        window["-FILE LIST-"].update(fnames)
    elif event == "-FILE LIST-":  # A file was chosen from the listbox
        try:
            filename = os.path.join(
                values["-FOLDER-"], values["-FILE LIST-"][0]
            )
            image = Image.open(filename)
            image = load_img(filename, target_size=(350, 350))
            image.thumbnail((400, 400))
            bio = io.BytesIO()
            image.save(bio, format="PNG")
            window["-IMAGE-"].update(data=bio.getvalue())
            #predict bird 
            image = load_img(filename, target_size=(224, 224))
            img = np.array(image)
            img = img / 255.0
            img = img.reshape(1,224,224,3)
            label = new_model.predict(img).argmax()
            r = label_thai[label]
            number = ''
            number += str(r)
            window["-i-"].update(number)
            d = detail[label]
            de = ''
            de += str(d)
            window["-textbox-"].update(de)
        except:
            pass  
window.close()